from gensim.models import word2vec

model = word2vec.Word2Vec.load('wiki.model')

#파이썬 유사어 조사
print(model.most_similar(positive=['Python', '파이썬']))

#아빠 - 남성 + 여성 = 엄마
print(model.most_similar(positive=['아빠', '여성'], negative=['남성'])[9])

#왕자 - 남성 + 여성 = 공주
print(model.most_similar(positive=['왕자', '여자'], negative=['남자']))

#왕자 - 남성 + 여성 = 공주
print(model.most_similar(positive=['왕자', '여성'], negative=['남성']))

#서울 - 한국 + 일본 = 도쿄
print(model.most_similar(positive=['서울', '일본'], negative=['대한민국']))
print(model.most_similar(positive=['서울', '일본'], negative=['한국']))

#중국의수도
print(model.most_similar(positive=['서울', '중국'], negative=['대한민국']))
print(model.most_similar(positive=['서울', '중국'], negative=['한국']))
#[('북경', 0.6895060539245605), ('상하이', 0.6297926902770996), ('베이징', 0.6262607574462891), ('서역', 0.622045636177063), ('대련', 0.586021363735199), ('운남성', 0.5851452350616455), ('심양', 0.584280788898468), ('봉천', 0.5796886682510376), ('北京', 0.5745342969894409), ('만주', 0.5678704977035522)]
#[('베이징', 0.6821848750114441), ('북경', 0.648127019405365), ('절강성', 0.6373119354248047), ('상하이', 0.6292018890380859), ('봉천', 0.620449960231781), ('산동성', 0.613395094871521), ('北京', 0.6115887761116028), ('광동성', 0.6005773544311523), ('충칭', 0.5980311632156372), ('산동', 0.5958592891693115)]


#서울과 맛집을 동시에 
print(model.most_similar(positive=['서울', '맛집'], ))

#분당과 정현석을 동시에 
print(model.most_similar(positive=['분당', '정현석'], negative=['여자']))
#[('민기식', 0.5588970184326172), ('변일', 0.5393919944763184), ('洪肯燮', 0.5157060027122498), ('朴元植', 0.5081902742385864), ('샤옌', 0.5070145726203918), ('군남댐', 0.49998655915260315), ('郭再祐', 0.4999004900455475), ('송평', 0.4984518885612488), ('김원웅', 0.4974576532840729), ('8723', 0.4971930980682373)]
print(model.most_similar(positive=['분당', '정현석'], negative=['여자']))




print("ok")

# [('Perl', 0.9213457107543945), ('Java', 0.906911313533783), ('Tcl', 0.905478835105896), ('MATLAB', 0.8736516237258911), ('Lisp', 0.869271457195282), ('자바스크립트', 0.8669256567955017), ('하스켈', 0.8633924126625061), ('JSP', 0.8586523532867432), ('IDL', 0.8562408685684204), ('CLI', 0.8507612943649292)]
